Tekla Open API Reference for Tekla Structures 2025
Identifier Methods
The Identifier type exposes the following members.
Methods
Name | Description
Equals(Object)
 Compares the identifier with another object instance.
 (Overrides Object.Equals(Object).)
Equals(Identifier)
 Compares the identifier with another identifier instance.
GetHashCode
 Gets the hash number of the identifier.
 (Overrides Object.GetHashCode().)
IsValid
 Returns true if the identifier seems to be valid. The validation is done based on the ID or GUID property.
ToString
 Returns the integer ID as a string.
 (Overrides Object.ToString().)
Top
See Also
Reference
Identifier Class
Tekla.Structures Namespace